tap 'homebrew/bundle'

tap 'caskroom/versions'


# Core command line utilities
brew 'git'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'gpg'
brew 'bash-git-prompt'
brew 'ctags'
brew 'the_silver_searcher'
brew 'postgresql'

tap 'thoughtbot/formulae'
brew 'rcm'

tap 'tldr-pages/tldr'
brew 'tldr'

tap 'neovim/neovim'
brew 'neovim', args: ['HEAD']


# Core GUI applications
cask 'iterm2'
cask 'spectacle'
cask 'flux'
cask 'bitbar'
# waiting on determining if I want to use my own license or not
# cask 'alfred'
# cask 'bartender'


# Fonts
tap 'caskroom/fonts'
cask 'font-m-plus'


# Other / fun
tap 'homebrew/games'
brew 'nethack'
