tap 'homebrew/bundle'

tap 'caskroom/versions'


# Core command line utilities
brew 'git'
brew 'vim'
brew 'tmux'
brew 'gpg'
brew 'wget'
cask 'ngrok'
brew 'bash-git-prompt'
brew 'heroku-toolbelt'
tap 'thoughtbot/formulae'
brew 'parity'
brew 'ctags'
brew 'the_silver_searcher'
tap 'tldr-pages/tldr'
brew 'tldr'
brew 'imagemagick'
brew 'p7zip'
brew 'openvpn'


# Core GUI applications
cask 'google-chrome'
# cask 'nylas-n1'
cask 'slack'
cask 'iterm2'
cask '1password'
cask 'spectacle'
cask 'alfred'
cask 'bartender'
cask 'flux'
cask 'bitbar'
cask 'spotify'
cask 'vlc'


# Other command line applications
cask 'cocoapods'
brew 'diff-so-fancy'
brew 'tree'
brew 'awscli'
cask 'java'
brew 'figlet'


# Other GUI applications
cask 'yakyak' # don't really use this... it doesn't turn my contact numbers into people's names
cask 'calibre'
cask 'evernote'
cask 'transmit'
cask 'dash'
cask 'send-to-kindle'
cask 'kindle'
cask 'aerial' # override for a feature that allows caching
cask 'superduper'
cask 'zeplin'
cask 'eclipse-ide'
cask 'android-studio'
cask 'genymotion'
cask 'sequel-pro'
cask 'charles'


# Other applications
brew 'postgresql'


# Security & Privacy applications
cask 'little-snitch'


# Fonts
tap 'caskroom/fonts'
cask 'font-m-plus'


# Other / fun
cask 'openemu-experimental'
tap 'homebrew/games'
brew 'nethack'


# Experimental
tap 'neovim/neovim'
brew 'neovim', args: ['HEAD']

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'mutt'
