tap 'homebrew/bundle'

tap 'caskroom/versions'


# Core command line utilities
brew 'git'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'gpg'
brew 'chruby'
brew 'ruby-install'
brew 'bash-git-prompt'
brew 'ctags'
brew 'the_silver_searcher'
brew 'watch'
brew 'postgresql'
brew 'imagemagick'
brew 'graphviz'
cask 'virtualbox'
cask 'docker-toolbox'
brew 'docker-machine-nfs'
brew 'diff-so-fancy'
brew 'jq'
brew 'phantomjs'
brew 'redis'
brew 'awscli'
brew 'exercism'
brew 'ffmpeg'
brew 'gifsicle'

brew 'freetds' # specific for the namely app's gem use
brew 'kubernetes-cli'
brew 'kubernetes-helm'

brew 'elixir'

tap 'thoughtbot/formulae'
brew 'rcm'

tap 'tldr-pages/tldr'
brew 'tldr'

tap 'neovim/neovim'
brew 'neovim', args: ['HEAD']


# Core GUI applications
cask 'iterm2'
cask 'spectacle'
cask 'flux'
cask 'bitbar'
cask 'alfred'
cask 'bartender'
cask 'libreoffice'
cask 'macdown'


# Fonts
tap 'caskroom/fonts'
cask 'font-m-plus'


# Other / fun
tap 'homebrew/games'
brew 'nethack'
